# Найдите корни квадратного уравнения Ax² + Bx + C = 0 с
# помощью математических формул нахождения корней квадратного уравнения

# a = 2
# b = 5
# c = -8
#
#
# if a == 0:
#     print('На ноль делить нельзя')
# else:
#     d = b ** 2 - 4 * a * c
#     x1 = (-b - d**0.5) / (2 * a)
#     x2 = (-b + d**0.5) / (2 * a)
#     if d < 0:
#         print('корни не могут быть найдены')
#     elif round((a * x1 * x1 + b * x1 + c), 2) == 0 and round((a * x2 * x2 + b * x2 + c), 2) == 0:
#         print(f'x1 = {round(x1, 2)}, x2 = {round(x2, 2)}')




