# Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа.
#
# *Примеры: *
#
# - 6,78 -> 7
# - 5 -> нет
# - 0,34 -> 3

# num = float(input('Введте вещественное число '))
#
# if int(num) == num:
#     print(f'{int(num)} -> нет')
# else:
#     print(f'{num} -> {int(abs(num) * 10) % 10}')


# ЧЕРЕЗ СТРОКИ
# num = input('Введте вещественное число ')
#
# num = num.split('.')
#
# print(num)
#
# if len(num)>1:
#     print(num[1][0])
# else:
#     print('Число целое')

# from decimal import Decimal
#
# numberD = Decimal('0.53464264')
# number = 0.53464264
# numberD *= 100
# print(number * 10)
# print(number)

from random import randint as RI

print(RI(0,1))
print(RI(0,1))
print(RI(0,1))
print(RI(0,1))
print(RI(0,1))
print(RI(0,1))
print(RI(0,1))
print(RI(0,1))


